function Footer() {
    return (
        <>
            <footer className="bg-[rgba(0,89,116,0.1)]">
                <div className=" container-pl py-8">
                    <div className="w-[23%] text-justify">
                        <a>
                            <svg width="50" height="51" viewBox="0 0 50 51" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M7.53748 23.6036H16.2325L21.9371 38.7715L36.1438 0.998047L44.6456 23.6036H50V27.6435H41.8483L36.1437 12.4755L21.937 50.249L13.4353 27.6435H7.53748C7.88232 27.0488 8.08081 26.3592 8.08081 25.6235C8.08081 24.8878 7.88232 24.1982 7.53748 23.6036Z" fill="#00B6BD" />
                                <path d="M4.04004 21.584V29.6639C1.81176 29.6639 -0.00036478 27.852 -0.00036478 25.6239C-0.00036478 23.3959 1.81176 21.584 4.04004 21.584Z" fill="#00CCB3" />
                                <path d="M7.53772 23.604C7.88257 24.1986 8.08105 24.8883 8.08105 25.6239C8.08105 26.3596 7.88257 27.0492 7.53772 27.6439C6.83813 28.8503 5.53328 29.6639 4.04065 29.6639V21.584C5.53318 21.584 6.83802 22.3975 7.53772 23.604Z" fill="#00EED1" />
                            </svg>
                        </a>
                        <p className="mt-5 text-[#0008] text-[15px] leading-[22.5px]">
                            <span>
                                ما در پلی کلینیک زندگی سعی
                                داریم تا به یکی از نیازهای اساسی بیماران پاسخ دهیم
                                و آن فـراهم نمودن مجموعه اقدامات درمانی است كه در آن
                                امكان دسترسی آسان به تخصص های مرتبط جهت بررسی روند
                                بيماری و كنترل عوارض آن، استفاده از خدمات آموزشی
                                ، هدايت و راهنمایی صحيح جهت افزايش سطـح آگاهی
                                و تغيير در نگرش و عملكرد بيماران است.<span className="text-[#00B6BD]">مشاهده بیشتر</span>
                            </span>
                        </p>
                    </div>
                </div>
            </footer>
        </>
    );
}

export default Footer;